app/Models/Inventory/InvCategoriesModel.php

SELECT `inv_categories`.`name`, COUNT(inv_items.id) as item_count
FROM `inv_categories`
LEFT JOIN `inv_items` ON `inv_items`.`category_id` = `inv_categories`.`id`
GROUP BY `inv_categories`.`id`
---
	  public function getCategoryItemCounts()
    {
        return $this->select('inv_categories.name, COUNT(inv_items.id) as item_count')
                    ->join('inv_items', 'inv_items.category_id = inv_categories.id', 'left')
                    ->groupBy('inv_categories.id')
                    ->findAll();