app/Models/Inventory/InvItemsModel.php

SELECT `inv_items`.*, `inv_categories`.`name` as `category_name`
FROM `inv_items`
JOIN `inv_categories` ON `inv_categories`.`id` = `inv_items`.`category_id`
---
	public function getItemsWithCategories()
    {
        // Join with InvCategoriesModel using category_id
        return $this->select('inv_items.*, inv_categories.name as category_name')
                    ->join('inv_categories', 'inv_categories.id = inv_items.category_id')
                    ->findAll();

SELECT *
FROM `inv_items`
---
	public function getAllItems(){
		 return $this->findAll();

SELECT `name`, (quantity * price) AS total
FROM `inv_items`
---
	 public function getItemTotals()
    {
        return $this->db->table($this->table)
            ->select('name, (quantity * price) AS total')
            ->get()
            ->getResultArray();

SELECT `inv_categories`.`name` AS `category_name`, SUM(inv_items.quantity * inv_items.price) AS total
FROM `inv_items`
JOIN `inv_categories` ON `inv_categories`.`id` = `inv_items`.`category_id`
GROUP BY `inv_items`.`category_id`
---
public function getCategoryTotals()
    {
        $builder = $this->db->table($this->table);
        $builder->select('inv_categories.name AS category_name, SUM(inv_items.quantity * inv_items.price) AS total');
        $builder->join('inv_categories', 'inv_categories.id = inv_items.category_id');
        $builder->groupBy('inv_items.category_id');

        $query = $builder->get();