app/Models/Inventory/InvSuppliersModel.php

	public function getAllSupplier(){
		return $this->findAll();
---
SELECT *
FROM `inv_suppliers`