app/Models/Inventory/ItemAssignmentsModel.php

SELECT `inv_items`.`name` as `item_name`, `user_tbl`.`LastName` as `last_name`, `user_tbl`.`FirstName` as `first_name`, `inv_item_assignments`.`serial_number`, `inv_item_assignments`.`assigned_at`, `inv_item_assignments`.`status`, `inv_item_assignments`.`id` as `id`
FROM `inv_item_assignments`
JOIN `inv_items` ON `inv_items`.`id` = `inv_item_assignments`.`item_id`
JOIN `user_tbl` ON `user_tbl`.`UserId` = `inv_item_assignments`.`user_id`
---
	public function getItemAndUser()
    {

        return $this->select('inv_items.name as item_name, user_tbl.LastName as last_name, user_tbl.FirstName as first_name, inv_item_assignments.serial_number, inv_item_assignments.assigned_at, inv_item_assignments.status, inv_item_assignments.id as id')
                    ->join('inv_items', 'inv_items.id = inv_item_assignments.item_id')
                    ->join('user_tbl', 'user_tbl.UserId = inv_item_assignments.user_id')
                    ->findAll();

SELECT `inv_item_assignments`.`status`, COUNT(inv_item_assignments.id) as status_total
FROM `inv_item_assignments`
GROUP BY `inv_item_assignments`.`status`
---
	public function countAssignmentStatus(){
		  return $this->select('inv_item_assignments.status, COUNT(inv_item_assignments.id) as status_total')
                    ->groupBy('inv_item_assignments.status')
                    ->findAll();