app/Controllers/Inventory/Categories.php

SELECT *
FROM `inv_categories`
---
    public function index()
    {
        $data['title'] = 'Category Lists';

        $categoryModel = new InvCategoriesModel();

        $data['categories'] = $categoryModel->findAll();