app/Controllers/Inventory/ItemAssignmentController.php

SELECT *
FROM `inv_item_assignments`
WHERE MD5(CONCAT(id, "delete")) = '034ac6a31cb9c800bd9e950fa10277c6'
 LIMIT 1
DELETE FROM `inv_item_assignments`
WHERE `id` IN ('8')
---
public function delete()
{
    $itemModel = new ItemAssignmentsModel();
    $id = $this->request->getGet('id');

    // Check if the item exists
    $item = $itemModel->where('MD5(CONCAT(id, "delete"))', $id)->first();

    if (!$item) {
        session()->setFlashdata('error', 'Assigned to not found.');
        return redirect()->to('inventory/assignments');
    }

    // Delete the item
    if ($itemModel->delete($item['id'])) {