app/Controllers/Inventory/Suppliers.php

    public function index()
    {
        $data['title'] = 'Supplier Lists';

        $supplierModel = new InvSuppliersModel();
		$data['suppliers']=$supplierModel->findAll();
---
SELECT *
FROM `inv_suppliers`