app/Controllers/Inventory/TransactionsController.php

   public function add()
{
    $data['title'] = 'New Transaction';
    helper('form');

    $transactionModel = new TransactionsModel();
    $itemModel = new InvItemsModel();
    $supplierModel = new InvSuppliersModel();

	$data['transaction_type']= ['purchase', 'sale', 'adjustment'] ;
    $data['itemLists'] = $itemModel->getAllItems();
	 // dd( $data['itemLists']);
    $data['suppliers'] = $supplierModel->getAllSupplier();
	 // dd( $data['suppliers']);
    if ($this->request->getMethod() === 'POST') {
        $rules = [
            'item_id' => ['label' => 'Item', 'rules' => 'required'],
            'transaction_type' => ['label' => 'Type of Transaction', 'rules' => 'required'],
            'quantity' => ['label' => 'Qunatity', 'rules' => 'required'],
            'price' => ['label' => 'Price', 'rules' => 'required'],
            'date' => ['label' => 'Date', 'rules' => 'required'],
            'supplier_id' => ['label' => 'Supplier (optional)', 'rules' => 'permit_empty']
        ];

        if (!$this->validate($rules)) {
            $data['validation'] = $this->validator;
        } else {
			//Check if the supplier id is in supplier tbl
			 $supplier_id = $this->request->getPost('supplier_id');
			if ($supplier_id) {
						$supplierExists = $supplierModel->find($supplier_id);
---
SELECT *
FROM `inv_suppliers`
WHERE `inv_suppliers`.`id` = '5'